public class AutoInc {
	public static void main (String[] args) {
		// int a = 10;
		// System.out.println(++a); // 증감연산자 추가 활용방법
		// // 증감연산자 변수의 앞뒤로 붙을수있다 앞에 ++가 붙을경우 +1 이 붙는데 뒤에 ++ 를 붙일경우 값이 먹질않는다
		// 뒤에 ++ 를 붙일경우 다음줄에 +1 이 붙어서 값이나온다
		// ++ 가 앞에오면 바로 붙고 ++ 가 뒤로 붙으면 그다음줄에 표기
		
		
		// int a = 10;
		// a++; // 위아래 전후를 표현할때 헷갈리지않게 println 위에 붙이면 그밑에 바로붙는다 (항상 붙일 println 위에 입력)
		// System.out.println(a);
		// a++; // ++ 를 println 밑으로 붙일경우 그 밑줄에 값이 먹힌다
		
		
		
		
		
		
		
		// 복합 대입 연산자 += -= ...
		// a += 1; // 최종값 11
		// a -= 1; // 최종값 10
		// 둘의 경우 +- 1씩 붙었으니 최종값은 그냥 기존의 a값 10
		
		// 증감연산자 ++수식을 붙일경우 +1값이 나온다 (지정해둔 a값 10에서부터 계산됨)
		
		
		// a++;
		// a++;
		// a++;
		
		
		
		// a--; // 마찬가지로 --수식을 붙일경우 -1값이나온다
		// ++ , -- 이런 부호들이 많이쓰인다
		
		// System.out.println(a);
	}
}
